# data.py
#
# Enter the category and question data here

# ----------------
#    Single Jep
# ----------------
SJ_CATEGORY_1 = "Эмпатия"
SJ_C1_Q1 = "Какие слова или фразы можно сказать, чтобы показать эмпатию к другому человеку?"
SJ_C1_A1 = "Например: Я понимаю, что ты чувствуешь"
SJ_C1_Q2 = "Почему важно проявлять эмпатию к другим людям?"
SJ_C1_A2 = "Потому что это помогает им чувствовать себя понятыми и поддержанными"
SJ_C1_Q3 = "Как можно развивать свою способность к эмпатии?"
SJ_C1_A3 = "Слушать внимательно других, пытаться поставить себя на их место и участвовать в ситуациях, где можно помочь кому-то"
SJ_C1_Q4 = "Представьте, что ваш друг испытывает грусть. Как вы можете проявить свою эмпатию к нему?"
SJ_C1_A4 = "Можно поговорить с ним, выслушать его, показать поддержку и помощь"
SJ_C1_Q5 = "Почему важно проявлять эмпатию даже к людям, которые отличаются от нас?"
SJ_C1_A5 = "Потому что каждый человек имеет свои чувства и нуждается в понимании и уважении"

SJ_CATEGORY_2 = "Принятие инаковости"
SJ_C2_Q1 = "Что означает принимать инаковость?"
SJ_C2_A1 = "Это значит уважать и принимать других людей, даже если они отличаются от нас"
SJ_C2_Q2 = "Какие качества помогают нам быть терпимыми?"
SJ_C2_A2 = "Открытость, понимание, уважение, готовность слушать и принимать других"
SJ_C2_Q3 = "Какие примеры терпимости вы можете назвать из вашей повседневной жизни?"
SJ_C2_A3 = "Уважение к разным культурам, дружба с людьми разных национальностей, принятие разнообразия в школе"
SJ_C2_Q4 = "Как можно преодолеть свои предрассудки и стать более терпимыми?"
SJ_C2_A4 = "Узнавать больше о других культурах и традициях, общаться с людьми разных вероисповеданий, стараться видеть мир через глаза других"
SJ_C2_Q5 = "Какие примеры непринятия или нетерпимости вы можете назвать и как они могут повлиять на отношения между людьми?"
SJ_C2_A5 = "Расизм, дискриминация, предрассудки. Они могут разрушить отношения, вызвать конфликты и несправедливость"

SJ_CATEGORY_3 = "Самоконтроль"
SJ_C3_Q1 = "Почему важно уметь контролировать себя?"
SJ_C3_A1 = "Это помогает нам принимать разумные решения, избегать ошибок и поддерживать хорошие отношения с другими"
SJ_C3_Q2 = "Как самоконтроль может помочь нам достичь своих целей?"
SJ_C3_A2 = "Он помогает нам быть целеустремленными, управлять своим временем и преодолевать трудности"
SJ_C3_Q3 = "Какая роль самоконтроля в нашей учебе и успехах?"
SJ_C3_A3 = "Он помогает нам сосредоточиться на заданиях, планировать время, учиться ответственности и переживать меньше стресса"
SJ_C3_Q4 = "Какие преимущества приносит нам самоконтроль в нашей повседневной жизни?"
SJ_C3_A4 = "Он помогает нам быть организованными, принимать ответственность за свои действия, строить качественные отношения с окружающими"
SJ_C3_Q5 = "Какие стратегии самоконтроля вы можете использовать, чтобы преодолеть соблазны и плохие привычки? "
SJ_C3_A5 = "Устанавливать четкие правила для себя, найти замену негативным привычкам, искать поддержку и мотивацию у других людей"

SJ_CATEGORY_4 = "Ответственность"
SJ_C4_Q1 = "Почему важно быть ответственным?"
SJ_C4_A1 = "Это помогает нам завершать задания в срок, строить доверительные отношения и достигать своих целей"
SJ_C4_Q2 = "Какие примеры ответственного поведения вы можете назвать?"
SJ_C4_A2 = "Завершение домашнего задания вовремя, помощь родителям, забота о домашних животных..."
SJ_C4_Q3 = "Как ответственность помогает нам в учебе?"
SJ_C4_A3 = "Она помогает нам быть организованными, выполнять домашнее задание, учиться и достигать успеха"
SJ_C4_Q4 = "Как можно развивать навыки ответственности?"
SJ_C4_A4 = "Постепенно брать на себя больше ответственности, учиться планировать время, быть последовательным в своих действиях"
SJ_C4_Q5 = "Какие проблемы могут возникнуть, если мы несем ответственность только за себя, но не заботимся о других людях?"
SJ_C4_A5 = "Мы можем разрушать отношения, испытывать чувство одиночества и недоверия"

SJ_CATEGORY_5 = "Уверенность в себе"
SJ_C5_Q1 = "Почему важно быть уверенным в себе?"
SJ_C5_A1 = "Это помогает нам преодолевать трудности, достигать своих целей и чувствовать себя счастливыми"
SJ_C5_Q2 = "Какие примеры уверенного поведения вы можете назвать?"
SJ_C5_A2 = "Говорить перед публикой, принимать решения, выступать в защиту своих убеждений"
SJ_C5_Q3 = "Какие стратегии можно использовать для развития уверенности в себе?"
SJ_C5_A3 = "Устанавливать реальные цели, практиковаться в навыках, общаться с поддерживающими людьми"
SJ_C5_Q4 = "Какие преимущества приносит нам уверенность в себе в нашей повседневной жизни?"
SJ_C5_A4 = "Она помогает нам принимать решения, строить положительные отношения и достигать успеха"
SJ_C5_Q5 = "Какие навыки и умения помогают развивать уверенность в себе?"
SJ_C5_A5 = "Умение принимать себя, выражать свои мысли и эмоции, учиться на своих ошибках"

SJ_CATEGORY_6 = "Мальчики и девочки"
SJ_C6_Q1 = "В чем основные различия между мальчиками и девочками?"
SJ_C6_A1 = "Физические различия и некоторые различия в интересах и предпочтениях"
SJ_C6_Q2 = "Какие стереотипы связаны с мальчиками и девочками?"
SJ_C6_A2 = "Мальчики должны быть сильными, девочки должны быть нежными"
SJ_C6_Q3 = "Какие примеры вы можете назвать, когда мальчики и девочки успешно работают вместе? "
SJ_C6_A3 = "Совместные проекты, командные спортивные игры, решение задач и проблем вместе"
SJ_C6_Q4 = "Какие преимущества принесет нам сотрудничество и понимание между мальчиками и девочками?"
SJ_C6_A4 = "Разнообразие идей и подходов, сильная и дружественная команда"
SJ_C6_Q5 = "Почему важно, чтобы мальчики и девочки чувствовали себя свободно в выборе своих интересов и предпочтений?"
SJ_C6_A5 = "Это способствует их индивидуальному развитию, креативности и самовыражению"

# ----------------
#    Double Jep
# ----------------
DJ_CATEGORY_1 = "Сотрудничество"
DJ_C1_Q1 = "Что означает сотрудничать?"
DJ_C1_A1 = "Работать вместе с другими людьми, делиться идеями и ресурсами"
DJ_C1_Q2 = "Почему сотрудничество важно в нашей жизни? "
DJ_C1_A2 = "Оно помогает нам достигать общих целей, решать проблемы и строить положительные отношения"
DJ_C1_Q3 = "Какие примеры сотрудничества вы можете назвать?"
DJ_C1_A3 = "Работа над групповым проектом, помощь однокласснику, решение конфликтов совместными усилиями"
DJ_C1_Q4 = "Какие навыки помогают успешно сотрудничать с другими людьми?"
DJ_C1_A4 = "Умение слушать, выражать свои мысли, уважать точку зрения других, решать конфликты"
DJ_C1_Q5 = "Как сотрудничество способствует развитию социальных навыков?"
DJ_C1_A5 = "Оно помогает нам учиться работать в команде, быть толерантными, учиться слушать и быть эмпатичными"

DJ_CATEGORY_2 = "Самоуважение и уважение к другим"
DJ_C2_Q1 = "Что означает самоуважение?"
DJ_C2_A1 = "Это когда мы ценим и уважаем себя, свои качества и достижения"
DJ_C2_Q2 = "Почему важно иметь самоуважение?"
DJ_C2_A2 = "Оно помогает нам верить в себя, принимать себя такими, какие мы есть, и достигать личного роста"
DJ_C2_Q3 = "Какие навыки помогают развивать самоуважение?"
DJ_C2_A3 = "Положительное мышление, умение устанавливать границы, заботиться о своих потребностях и здоровье"
DJ_C2_Q4 = "Почему важно уважать других людей?"
DJ_C2_A4 = "Это помогает нам строить здоровые и гармоничные отношения, проявлять эмпатию и поддержку"
DJ_C2_Q5 = "Какие примеры вы можете назвать, когда мы проявляем уважение к другим?"
DJ_C2_A5 = "Слушать и уважать мнение других, быть внимательными и добрыми, помогать и поддерживать других"

DJ_CATEGORY_3 = "Ценности"
DJ_C3_Q1 = "Что такое ценности?"
DJ_C3_A1 = "Ценности - это то, что мы считаем важным и ценным в жизни. Они представляют собой основные принципы и убеждения, которые определяют наше отношение к миру и влияют на наши действия и решения."
DJ_C3_Q2 = "Какие могут быть примеры ценностей?"
DJ_C3_A2 = "Примеры ценностей включают семью, дружбу, честность, ответственность, творчество, справедливость, уважение к окружающей среде, знание, независимость, здоровье, справедливость и толерантность. Это лишь некоторые из множества возможных ценностей, которые могут быть важными для конкретного человека."
DJ_C3_Q3 = "Как ценности могут помочь нам преодолевать трудности и принимать решения?"
DJ_C3_A3 = "Ценности помогают нам определить, что для нас важно и что мы готовы делать, чтобы достичь своих целей. Они служат ориентирами в принятии решений и выборе пути действий. Во время трудностей они помогают нам оставаться верными себе и преодолевать препятствия, основываясь на том, что для нас действительно ценно."
DJ_C3_Q4 = "Какие преимущества принесет нам жизнь в соответствии с нашими ценностями?"
DJ_C3_A4 = "Жизнь, основанная на наших ценностях, принесет нам удовлетворение, чувство наполненности и гармонию внутри себя и с окружающим миром. Когда мы живем в соответствии с тем, что для нас действительно важно, мы ощущаем смысл и цель в своих действиях. Это помогает нам испытывать большую радость и удовлетворение от жизни, так как мы нацелены на то, что действительно ценно для нас."
DJ_C3_Q5 = "Как наши ценности могут влиять на наше благополучие и счастье?"
DJ_C3_A5 = "Наши ценности могут влиять на наше благополучие и счастье, поскольку они помогают нам определить свое предназначение и приоритеты в жизни. Когда мы живем в соответствии с нашими ценностями, мы чувствуем гармонию и целостность. Мы можем развивать себя в тех областях, которые для нас важны, и строить отношения, основанные на общих ценностях. Такая жизнь помогает нам наслаждаться глубоким удовлетворением и счастьем, которые исходят из осознания, что мы следуем своим истинным ценностям."

DJ_CATEGORY_4 = "Эмоции"
DJ_C4_Q1 = "Что такое эмоции?"
DJ_C4_A1 = "Эмоции - это наши чувства и реакции на окружающий мир. Они являются внутренними состояниями, которые возникают в ответ на определенные ситуации, события или мысли. Эмоции могут быть положительными (например, радость, восторг) или отрицательными (например, грусть, злость)."
DJ_C4_Q2 = "Какие бывают эмоции?"
DJ_C4_A2 = "Существует множество эмоций, которые мы можем испытывать. Некоторые из них включают радость, грусть, страх, злость, удивление, восхищение, удовлетворение, стыд, страсть, тревогу, волнение и многие другие. Эмоции могут иметь различную интенсивность и продолжительность в зависимости от ситуации и нашего восприятия."
DJ_C4_Q3 = "Что делать, когда мы испытываем отрицательные эмоции, например, грусть или злость?"
DJ_C4_A3 = "Когда мы испытываем отрицательные эмоции, важно найти способы справиться с ними. Мы можем искать способы успокоиться, например, через глубокое дыхание, медитацию или физическую активность. Также полезно общаться с доверенными людьми, высказать свои чувства и эмоции. Заниматься любимыми делами или хобби также может помочь снять негативные эмоции и восстановить эмоциональное равновесие."
DJ_C4_Q4 = "Как положительные эмоции влияют на наше самочувствие и благополучие?"
DJ_C4_A4 = "Положительные эмоции имеют значительное влияние на наше самочувствие и благополучие. Они могут повышать настроение, укреплять наше здоровье и создавать позитивный настрой. Когда мы испытываем положительные эмоции, мы чувствуем радость, удовлетворение и энергию, что способствует нашей общей жизненной удовлетворенности и благополучию."
DJ_C4_Q5 = "Как мы можем использовать позитивные эмоции для создания приятной и гармоничной атмосферы в нашей жизни?"
DJ_C4_A5 = "Мы можем использовать позитивные эмоции для создания приятной и гармоничной атмосферы в нашей жизни, например, выражая благодарность за то, что у нас есть. Мы можем делиться положительными эмоциями с другими людьми, проявлять заботу и поддержку. Заниматься любимыми хобби и деятельностью, которые вызывают положительные эмоции, также помогает создать приятную атмосферу в нашей жизни. Умение находить и ценить радость в маленьких вещах помогает нам строить более счастливую и эмоционально богатую жизнь."

DJ_CATEGORY_5 = "Конфликт и его разрешение"
DJ_C5_Q1 = "Что такое конфликт?"
DJ_C5_A1 = "Конфликт - это ситуация, когда две или более стороны имеют различные мнения, желания или потребности, которые противоречат друг другу. Конфликты могут возникать в разных сферах жизни, включая отношения с другими людьми, работу, образование и другие области."
DJ_C5_Q2 = "Какие могут быть причины конфликтов?"
DJ_C5_A2 = "Причины конфликтов могут быть разнообразными. Различия во мнениях, ценностях и убеждениях могут стать источником конфликтов. Конкуренция за ресурсы, такие как деньги, власть или признание, также может приводить к конфликтам. Недостаток понимания и коммуникации между сторонами также может способствовать возникновению конфликтов."
DJ_C5_Q3 = "Как можно разрешить конфликт мирно?"
DJ_C5_A3 = "Для мирного разрешения конфликта можно применять различные стратегии. Важно слушать друг друга и понимать позицию каждой стороны. Поиск компромиссов и использование ненасильственных способов решения проблем, таких как диалог, поиск общих интересов и взаимопонимание, может помочь достичь согласия и разрешить конфликт."
DJ_C5_Q4 = "Как можно примириться после конфликта?"
DJ_C5_A4 = "Примирение после конфликта требует взаимной готовности и работы над восстановлением отношений. Важно признавать свои ошибки и быть готовым извиниться, если это необходимо. Нахождение общих интересов и поиски способов восстановления доверия и гармоничных отношений также являются важными шагами к примирению."
DJ_C5_Q5 = "Как важно сохранять спокойствие и контролировать свои эмоции во время конфликта?"
DJ_C5_A5 = "Сохранение спокойствия и контроль над эмоциями являются важными аспектами во время конфликта. Это помогает нам принимать рациональные решения и избегать неконструктивных поведенческих реакций, таких как агрессия и насилие. Когда мы способны контролировать свои эмоции, мы лучше осознаем ситуацию и можем более эффективно общаться с другими людьми, что способствует конструктивному разговору и решению проблем."

DJ_CATEGORY_6 = "Мотивация и достижение целей"
DJ_C6_Q1 = "Что такое мотивация?"
DJ_C6_A1 = "Мотивация - это то, что побуждает нас действовать и стремиться к достижению цели. Она представляет собой внутреннюю силу или внешний стимул, который подталкивает нас к действию и помогает преодолевать препятствия на пути к достижению целей."
DJ_C6_Q2 = "Какие могут быть источники мотивации?"
DJ_C6_A2 = "Источники мотивации могут быть разнообразными и индивидуальными для каждого человека. Желание получить награду, достичь признания или успеха, стремление показать свои способности и достоинства, интерес к определенной деятельности или убеждение в важности поставленных целей - все это может служить источниками мотивации."
DJ_C6_Q3 = "Какие стратегии помогают достигать поставленные цели?"
DJ_C6_A3 = "Для достижения поставленных целей можно использовать различные стратегии. Планирование играет важную роль, помогая структурировать задачи и определить необходимые шаги к достижению цели. Разбиение большой цели на более маленькие, достижимые шаги помогает уменьшить ощущение сложности и увеличить мотивацию. Также полезно устанавливать себе приятные награды по достижении промежуточных этапов или завершении цели, чтобы поддерживать мотивацию и ощущение удовлетворения."
DJ_C6_Q4 = "Как помогает участие в конкурсах и соревнованиях в достижении целей?"
DJ_C6_A4 = "Участие в конкурсах и соревнованиях может быть стимулом для роста, самосовершенствования и достижения личных целей. Конкурсная среда может вызывать энергию и амбиции, повышая уровень мотивации. Кроме того, участие в конкурсах может предоставить возможность для самооценки, обратной связи и сравнения с другими, что способствует развитию и повышению профессиональных навыков."
DJ_C6_Q5 = "Как важно отмечать свои достижения и радоваться им?"
DJ_C6_A5 = "Отмечание своих достижений и радость от них играют важную роль в поддержании мотивации и достижении дальнейших целей. Празднование достижений помогает укрепить уверенность в себе, поддерживает позитивное настроение и мотивацию к новым вызовам и целям. Радость от достижений создает позитивную эмоциональную окраску и усиливает нашу веру в себя и свои способности."

# ---------------
#    Final Jep
# ---------------
FJ_CATEGORY = "Развитие эмпатии и межличностных навыков"
FJQ = "Ваш лучший друг в школе неожиданно начал проявлять грубость и избегать общения. Вы заметили, что он выглядит грустным и подавленным. Какие действия вы предпримете, чтобы помочь ему?"
FJA = "Подойти к другу и спросить, что с ним происходит, выслушать его и попробовать помочь."

class GameData:
    def __init__(self):
        self.create_ds()

    def create_ds(self):
        self.data = \
        {
        1: 
            {
            'categories': 
            [
                SJ_CATEGORY_1,
                SJ_CATEGORY_2,
                SJ_CATEGORY_3,
                SJ_CATEGORY_4,
                SJ_CATEGORY_5,
                SJ_CATEGORY_6
            ],
            'questions':
            [
                [SJ_C1_Q1, SJ_C2_Q1, SJ_C3_Q1, SJ_C4_Q1, SJ_C5_Q1, SJ_C6_Q1],
                [SJ_C1_Q2, SJ_C2_Q2, SJ_C3_Q2, SJ_C4_Q2, SJ_C5_Q2, SJ_C6_Q2],
                [SJ_C1_Q3, SJ_C2_Q3, SJ_C3_Q3, SJ_C4_Q3, SJ_C5_Q3, SJ_C6_Q3],
                [SJ_C1_Q4, SJ_C2_Q4, SJ_C3_Q4, SJ_C4_Q4, SJ_C5_Q4, SJ_C6_Q4],
                [SJ_C1_Q5, SJ_C2_Q5, SJ_C3_Q5, SJ_C4_Q5, SJ_C5_Q5, SJ_C6_Q5]
            ],
            'answers':
            [
                [SJ_C1_A1, SJ_C2_A1, SJ_C3_A1, SJ_C4_A1, SJ_C5_A1, SJ_C6_A1],
                [SJ_C1_A2, SJ_C2_A2, SJ_C3_A2, SJ_C4_A2, SJ_C5_A2, SJ_C6_A2],
                [SJ_C1_A3, SJ_C2_A3, SJ_C3_A3, SJ_C4_A3, SJ_C5_A3, SJ_C6_A3],
                [SJ_C1_A4, SJ_C2_A4, SJ_C3_A4, SJ_C4_A4, SJ_C5_A4, SJ_C6_A4],
                [SJ_C1_A5, SJ_C2_A5, SJ_C3_A5, SJ_C4_A5, SJ_C5_A5, SJ_C6_A5]
            ]
            },
        2:
            {
            'categories': 
            [
                DJ_CATEGORY_1,
                DJ_CATEGORY_2,
                DJ_CATEGORY_3,
                DJ_CATEGORY_4,
                DJ_CATEGORY_5,
                DJ_CATEGORY_6
            ],
            'questions':
            [
                [DJ_C1_Q1, DJ_C2_Q1, DJ_C3_Q1, DJ_C4_Q1, DJ_C5_Q1, DJ_C6_Q1],
                [DJ_C1_Q2, DJ_C2_Q2, DJ_C3_Q2, DJ_C4_Q2, DJ_C5_Q2, DJ_C6_Q2],
                [DJ_C1_Q3, DJ_C2_Q3, DJ_C3_Q3, DJ_C4_Q3, DJ_C5_Q3, DJ_C6_Q3],
                [DJ_C1_Q4, DJ_C2_Q4, DJ_C3_Q4, DJ_C4_Q4, DJ_C5_Q4, DJ_C6_Q4],
                [DJ_C1_Q5, DJ_C2_Q5, DJ_C3_Q5, DJ_C4_Q5, DJ_C5_Q5, DJ_C6_Q5]
            ],
            'answers':
            [
                [DJ_C1_A1, DJ_C2_A1, DJ_C3_A1, DJ_C4_A1, DJ_C5_A1, DJ_C6_A1],
                [DJ_C1_A2, DJ_C2_A2, DJ_C3_A2, DJ_C4_A2, DJ_C5_A2, DJ_C6_A2],
                [DJ_C1_A3, DJ_C2_A3, DJ_C3_A3, DJ_C4_A3, DJ_C5_A3, DJ_C6_A3],
                [DJ_C1_A4, DJ_C2_A4, DJ_C3_A4, DJ_C4_A4, DJ_C5_A4, DJ_C6_A4],
                [DJ_C1_A5, DJ_C2_A5, DJ_C3_A5, DJ_C4_A5, DJ_C5_A5, DJ_C6_A5]
            ]
            },
        3:
            {
            'categories': [FJ_CATEGORY],
            'questions': [[FJQ]],
            'answers': [[FJA]]
            }
        }

    def get_cats_for_round(self, r):
        return self.data[r]['categories']

    def get_questions_for_round(self, r):
        return self.data[r]['questions']

    def get_answers_for_round(self, r):
        return self.data[r]['answers']
